package tasks;

/*Напишите метод, который принимает массив последовательных (возрастающих) букв в качестве входных данных
и возвращает недостающую букву в массиве.
В массиве всегда будет отсутствовать ровно одна буква. Длина массива всегда будет составлять не менее 2.
Массив всегда будет содержать буквы только в одном регистре.
['a','b','c','d','f'] -> 'e'
['O','Q','R','S'] -> 'P'*/

public class Find_The_Missing_Letter {
    public static char findMissingLetter(char[] array) {
        int index = 0;
        for (char i = array[0]; i <= 'z'; i++) {
            if (array[index++] > i)
                return i;
        }
        return ' ';
    }
}
