package tasks;

import java.util.ArrayList;

/*Мексиканская волна является примером метахронного ритма, достигаемого на переполненном стадионе,
когда сменяющие друг друга группы зрителей ненадолго встают, кричат и поднимают руки.
Сразу же после вытягивания в полный рост зритель возвращается в сидячее положение.

Необзодимо создать функцию, которая превращает строку в мексиканскую волну.
Вам будет передана строка, и вы должны вернуть эту строку в массиве, где заглавная буква обозначает человека стоящего.

1. Входная строка всегда будет строчной, но, возможно, пустой.
2. Если символ в строке является пробелом, то передайте его так, как если бы это было пустое место*/

public class Mexican_Wave {
    public static String[] wave(String str) {
        ArrayList<String> list = new ArrayList<>();
        String s = "";
        for (int i = 0; i < str.length(); i++) {
            if (str.charAt(i) != ' ') {
                s = str.substring(0, i) + Character.toUpperCase(str.charAt(i)) + str.substring(i + 1);
                list.add(s);
            }
        }

        return list.toArray(new String[0]);
    }
}
