package tasks;

/*Напишите функцию, которая принимает строку фигурных скобок и определяет, является ли порядок фигурных скобок допустимым.
Он должен возвращать true, если строка допустима, и false, если она недопустима.

Все входные строки будут непустыми и будут состоять только из скобок: ()[]{}.

Строка фигурных скобок считается допустимой, если все скобки сопоставлены с правильной скобкой.*/

public class Valid_Braces {
    public static boolean isValid(String braces) {
        String s = braces;
        for (int i = 0; i < braces.length() / 2; i++) {
            s = s.replaceAll("\\(\\)|\\[\\]|\\{\\}", "");
        }

        return s.isEmpty();
    }
}
